"""在Linux终端中输出彩色文本
（使用第三方包colorama也可以在Windows中实现此效果）
"""
# from colorama import init
# init()


def main():
    print("\033[1;30m灰色文本\033[0m")
    print("\033[1;31m红色文本\033[0m")
    print("\033[1;32m绿色文本\033[0m")
    print("\033[1;33m黄色文本\033[0m")
    print("\033[1;34m蓝色文本\033[0m")
    print("\033[1;35m品红色文本\033[0m")
    print("\033[1;36m青色文本\033[0m")
    print("\033[1;37m白色文本\033[0m")
    print("\033[1;37;40m白色文本黑色背景\033[0m")
    print("\033[1;36;41m青色文本红色背景\033[0m")
    print("\033[1;35;42m品红色文本绿色背景\033[0m")
    print("\033[1;34;43m蓝色文本黄色背景\033[0m")
    print("\033[1;33;44m黄色文本蓝色背景\033[0m")
    print("\033[1;32;45m绿色文本品红色背景\033[0m")
    print("\033[1;31;46m红色文本青色背景\033[0m")
    print("\033[1;30;47m灰色文本灰色背景\033[0m")


if __name__ == "__main__":
    main()
